[
  {
    "lifecycleId": "LC_O2C", // Order to Cash
    "stages": [
      {
        "stageId": "O2C_S01",
        "stageName": "Customer Inquiry & Quotation",
        "commonPainPoints": [
          "Providing incorrect product information or pricing to potential customers.",
          "Slow response times to inquiries due to difficulty finding information.",
          "Inconsistent quoting across different sales reps or channels.",
          "Inability to accurately assess product availability for quotes."
        ],
        "criticalDimensionDamaIds": [3, 5, 12, 14, 20, 26, 48, 53, 57], // Accuracy, Availability, Completeness(Rec,Val), Consistency, Currency, Relevance, Timeliness, Validity
        "impactOfPoorDQ": "Lost sales opportunities due to slow or inaccurate responses. Damaged initial customer perception. Wasted sales effort on non-viable quotes. Price erosion due to inconsistent quoting."
      },
      {
        "stageId": "O2C_S02",
        "stageName": "Order Entry & Management",
        "commonPainPoints": [
          "High rates of manual data entry errors for orders.",
          "Orders placed for discontinued or out-of-stock items.",
          "Incorrect customer addresses or shipping details captured.",
          "Difficulties in validating customer credit status leading to risky orders.",
          "Delays in order processing due to incomplete or inconsistent order information."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 15, 20, 24, 26, 47, 56, 57], // Accuracy, Completeness(Rec,Val,AttrVal), Consistency(Gen,RecLvl), Currency, Ref.Integrity, Uniqueness(Rec), Validity
        "impactOfPoorDQ": "Increased operational costs due to order corrections and rework. Customer dissatisfaction from incorrect orders. Fulfillment delays and errors. Potential financial loss from unfulfillable orders or shipping to wrong addresses. Revenue recognition issues."
      },
      {
        "stageId": "O2C_S03",
        "stageName": "Order Fulfillment & Shipping",
        "commonPainPoints": [
          "Picking wrong items or quantities from inventory.",
          "Shipping to incorrect or outdated customer addresses.",
          "Delays in shipment due to inaccurate inventory data or poor logistics coordination.",
          "Lack of visibility into shipment status for customers.",
          "High shipping costs due to inefficient routing or incorrect package details."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 30, 32, 53, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Integrity, Latency, Timeliness, Validity
        "impactOfPoorDQ": "Increased returns and reshipment costs. Customer complaints and dissatisfaction. Damage to brand reputation. Inefficient use of warehouse and logistics resources. Potential loss of goods."
      },
      {
        "stageId": "O2C_S04",
        "stageName": "Invoicing & Billing",
        "commonPainPoints": [
          "Invoices with incorrect pricing, quantities, or customer details.",
          "Billing disputes leading to delayed payments.",
          "Manual effort and errors in generating invoices.",
          "Non-compliance with customer-specific billing requirements."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 24, 47, 57], // Accuracy, Completeness(Rec,Val), Consistency(Gen,RecLvl), Ref.Integrity, Validity
        "impactOfPoorDQ": "Increased Days Sales Outstanding (DSO). Revenue leakage due to under-billing or unbilled items. High administrative costs for resolving billing disputes and re-issuing invoices. Customer dissatisfaction and potential legal issues."
      },
      {
        "stageId": "O2C_S05",
        "stageName": "Payment Collection & Reconciliation",
        "commonPainPoints": [
          "Difficulty in matching payments to outstanding invoices.",
          "Errors in applying cash receipts.",
          "Delays in identifying and following up on overdue payments.",
          "Manual and time-consuming bank reconciliation processes."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 47, 56], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Ref.Integrity, Uniqueness(Rec)
        "impactOfPoorDQ": "Poor cash flow management. Increased bad debt risk. Wasted accounting effort on reconciliation. Inaccurate view of accounts receivable."
      },
      {
        "stageId": "O2C_S06",
        "stageName": "Returns & Dispute Management",
        "commonPainPoints": [
          "Slow processing of customer returns and refunds.",
          "Difficulty in tracking returned goods and their condition.",
          "Inconsistent application of return policies.",
          "Lack of root cause analysis for returns and disputes."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 53, 54, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Timeliness, Traceability, Validity
        "impactOfPoorDQ": "Customer dissatisfaction with return process. Increased inventory costs for returned goods. Inability to identify and fix systemic issues causing returns. Potential for fraudulent returns if data is poor."
      }
    ]
  },
  {
    "lifecycleId": "LC_P2P", // Procure to Pay
    "stages": [
      {
        "stageId": "P2P_S01",
        "stageName": "Requisition & Need Identification",
        "commonPainPoints": [
          "Unclear or inaccurate specifications for requested goods/services.",
          "Duplicate requisitions for the same need.",
          "Lack of visibility into existing inventory or approved supplier catalogs, leading to off-contract spend.",
          "Manual and slow requisition approval processes."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 46, 48, 56, 57], // Accuracy, Completeness(Rec,Val), Consistency, Redundancy, Relevance, Uniqueness(Rec), Validity
        "impactOfPoorDQ": "Procurement of wrong items/services. Wasted spend on unnecessary purchases. Higher costs due to maverick buying. Delays in procurement cycle."
      },
      {
        "stageId": "P2P_S02",
        "stageName": "Supplier Selection & Purchase Order Creation",
        "commonPainPoints": [
          "Using outdated or inaccurate supplier information (contacts, pricing, capabilities).",
          "Purchase Orders (POs) created with incorrect item codes, quantities, or prices.",
          "Lack of clear criteria or data for objective supplier evaluation.",
          "Manual PO creation leading to errors and delays."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 19, 20, 26, 51, 55, 57], // Accuracy, Completeness(Rec,Val), Confidentiality (supplier data), Consistency, Currency, Reputation (supplier), Uniqueness(Obj), Validity
        "impactOfPoorDQ": "Overpayment for goods/services. Strained supplier relationships due to PO errors. Risk of selecting unreliable suppliers. Delays in receiving goods/services."
      },
      {
        "stageId": "P2P_S03",
        "stageName": "Goods/Service Receipt & Inspection",
        "commonPainPoints": [
          "Difficulty in matching received goods against POs (e.g., no PO number on delivery).",
          "Inaccurate recording of quantities received or services performed.",
          "Failure to identify damaged or non-conforming goods upon receipt.",
          "Delays in updating inventory systems after receipt."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 30, 53, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Integrity, Timeliness, Validity
        "impactOfPoorDQ": "Payment for goods not received or services not rendered. Incorrect inventory levels leading to stockouts or overstock. Acceptance of substandard goods. Delays in availability of materials for production."
      },
      {
        "stageId": "P2P_S04",
        "stageName": "Invoice Processing & Verification",
        "commonPainPoints": [
          "High volume of invoice exceptions and discrepancies (e.g., price, quantity mismatches with PO/receipt).",
          "Manual and error-prone matching of invoices to POs and goods receipts (3-way match).",
          "Duplicate invoice payments.",
          "Delayed invoice processing leading to missed early payment discounts or late payment penalties."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 24, 47, 56, 57], // Accuracy, Completeness(Rec,Val), Consistency(Gen,RecLvl), Ref.Integrity, Uniqueness(Rec), Validity
        "impactOfPoorDQ": "Overpayments or underpayments to suppliers. Increased administrative costs for exception handling. Lost financial benefits (discounts). Strained supplier relationships due to payment issues."
      },
      {
        "stageId": "P2P_S05",
        "stageName": "Payment & Reconciliation",
        "commonPainPoints": [
          "Payments made to incorrect bank accounts or wrong supplier entities.",
          "Errors in payment amounts or currency.",
          "Difficulties in reconciling payments with bank statements and accounts payable records.",
          "Lack of visibility into payment status."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 47, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Ref.Integrity, Validity
        "impactOfPoorDQ": "Financial loss due to incorrect payments or fraud. Compliance issues with payment processing. Strained supplier relations. Inefficient use of accounting resources for reconciliation."
      },
      {
        "stageId": "P2P_S06",
        "stageName": "Supplier Relationship Management",
        "commonPainPoints": [
          "Lack of accurate and complete supplier performance data (e.g., on-time delivery, quality).",
          "Inconsistent communication or outdated contact information for suppliers.",
          "Difficulty in segmenting suppliers or assessing supplier risk.",
          "Subjective supplier evaluations not based on objective data."
        ],
        "criticalDimensionDamaIds": [3, 10, 12, 14, 20, 26, 36, 48, 51, 53, 55], // Accuracy, Comparability(Time), Completeness(Rec,Val), Consistency, Currency, Objectivity, Relevance, Reputation, Timeliness, Uniqueness(Obj)
        "impactOfPoorDQ": "Inability to effectively manage supplier performance and drive improvements. Increased supply chain risk. Missed opportunities for better terms or collaboration. Over-reliance on problematic suppliers."
      }
    ]
  },
  {
    "lifecycleId": "LC_H2R", // Hire to Retire
    "stages": [
      {
        "stageId": "H2R_S01",
        "stageName": "Recruitment & Talent Acquisition",
        "commonPainPoints": [
          "Inaccurate job descriptions leading to mismatched candidates.",
          "Poor candidate experience due to slow or error-prone application processes.",
          "Difficulty tracking applicants and their status.",
          "Bias in screening due to inconsistent data capture or evaluation criteria."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 36, 48, 55, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Objectivity, Relevance, Uniqueness(Obj - candidate), Validity
        "impactOfPoorDQ": "Hiring unsuitable candidates. High recruitment costs. Damage to employer brand. Potential discrimination claims."
      },
      {
        "stageId": "H2R_S02",
        "stageName": "Onboarding & Integration",
        "commonPainPoints": [
          "Incorrect employee data captured in HR/payroll systems (name, address, bank details).",
          "Delays in provisioning system access or necessary equipment.",
          "Incomplete onboarding paperwork or compliance documentation.",
          "Poor communication of company policies and procedures."
        ],
        "criticalDimensionDamaIds": [1, 3, 12, 14, 15, 17, 19, 20, 26, 53, 57], // Access Security, Accuracy, Completeness(Rec,Val,AttrVal), Compliance(Data), Confidentiality, Consistency, Currency, Timeliness, Validity
        "impactOfPoorDQ": "Payroll errors. Security risks from improper access. Compliance breaches. Reduced new hire productivity and engagement."
      },
      {
        "stageId": "H2R_S03",
        "stageName": "Performance Management & Development",
        "commonPainPoints": [
          "Performance reviews based on subjective or incomplete data.",
          "Inconsistent application of performance criteria across employees/departments.",
          "Lack of accurate data to identify training needs or track skill development.",
          "Difficulty linking performance to compensation or promotions fairly."
        ],
        "criticalDimensionDamaIds": [3, 10, 12, 14, 20, 36, 48, 50], // Accuracy, Comparability(Time), Completeness(Rec,Val), Consistency, Objectivity, Relevance, Reproducibility
        "impactOfPoorDQ": "Demotivated employees due to perceived unfairness. Ineffective training investments. Poor succession planning. Legal risks in promotion/termination decisions."
      },
      {
        "stageId": "H2R_S04",
        "stageName": "Compensation & Benefits Administration",
        "commonPainPoints": [
          "Errors in calculating salaries, bonuses, or overtime pay.",
          "Incorrect deductions for benefits or taxes.",
          "Delays in processing payroll or benefits enrollments.",
          "Difficulties managing leave balances accurately."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 17, 20, 26, 57], // Accuracy, Completeness(Rec,Val), Compliance(Data), Consistency, Currency, Validity
        "impactOfPoorDQ": "Employee dissatisfaction and trust erosion. Financial penalties for incorrect tax withholding or payments. Overpayments or underpayments. Legal compliance issues."
      },
      {
        "stageId": "H2R_S05",
        "stageName": "Employee Engagement & Relations",
        "commonPainPoints": [
          "Lack of reliable data on employee sentiment or engagement levels.",
          "Inconsistent recording or handling of employee grievances.",
          "Difficulty tracking diversity and inclusion metrics accurately.",
          "Poor communication due to outdated employee contact information."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 19, 20, 26, 36, 48, 51], // Accuracy, Completeness(Rec,Val), Confidentiality, Consistency, Currency, Objectivity, Relevance, Reputation (of survey data)
        "impactOfPoorDQ": "Inability to proactively address employee concerns. Increased attrition. Potential for workplace disputes. Ineffective D&I initiatives."
      },
      {
        "stageId": "H2R_S06",
        "stageName": "Offboarding & Separation",
        "commonPainPoints": [
          "Delays in de-provisioning system access for departing employees, posing security risks.",
          "Errors in final pay calculations or severance packages.",
          "Incomplete exit interview data capture or analysis.",
          "Failure to comply with legal requirements for termination documentation."
        ],
        "criticalDimensionDamaIds": [1, 3, 12, 14, 17, 19, 20, 26, 52, 53, 57], // Access Security, Accuracy, Completeness(Rec,Val), Compliance(Data), Confidentiality, Consistency, Currency, Retention Period, Timeliness, Validity
        "impactOfPoorDQ": "Security vulnerabilities. Financial errors in final settlements. Lost opportunity to gather valuable feedback. Legal and compliance risks."
      }
    ]
  },
  {
    "lifecycleId": "LC_R2R", // Record to Report
    "stages": [
      {
        "stageId": "R2R_S01",
        "stageName": "Transaction Recording & Data Capture",
        "commonPainPoints": [
          "Manual entry errors in journal entries or sub-ledger transactions.",
          "Incomplete capture of all required transaction details.",
          "Incorrect coding of transactions (e.g., wrong account, department, cost center).",
          "Delays in recording transactions, leading to outdated financial views."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 24, 26, 53, 57], // Accuracy, Completeness(Rec,Val), Consistency(Gen,RecLvl), Currency, Timeliness, Validity
        "impactOfPoorDQ": "Inaccurate general ledger balances. Difficulty in reconciling sub-ledgers. Misstated financial positions. Increased effort for corrections during period-end close."
      },
      {
        "stageId": "R2R_S02",
        "stageName": "Period-End Close & Consolidation",
        "commonPainPoints": [
          "Lengthy and stressful month/quarter/year-end close processes.",
          "Difficulties in reconciling intercompany transactions or balance sheet accounts.",
          "Errors in consolidation adjustments or currency conversions.",
          "Lack of visibility into the status of close tasks."
        ],
        "criticalDimensionDamaIds": [3, 8, 10, 12, 14, 20, 22, 26, 47, 50, 57], // Accuracy, Coherence, Comparability(Time), Completeness(Rec,Val), Consistency(Gen,AcrossDatasets), Currency, Ref.Integrity, Reproducibility, Validity
        "impactOfPoorDQ": "Delayed financial reporting. Inaccurate consolidated financial statements. Increased audit scrutiny and risk of material misstatements. High stress levels for finance teams."
      },
      {
        "stageId": "R2R_S03",
        "stageName": "Financial Reporting & Analysis",
        "commonPainPoints": [
          "Reports containing inaccurate or inconsistent figures.",
          "Inability to drill down from summary reports to underlying details.",
          "Slow generation of management reports, hindering timely analysis.",
          "Lack of confidence in financial numbers by stakeholders."
        ],
        "criticalDimensionDamaIds": [3, 7, 8, 10, 12, 14, 16, 20, 31, 48, 50, 53, 54], // Accuracy, Clarity(Meta), Coherence, Comparability(Time), Completeness(Rec,Val,Meta), Consistency, Interpretability, Relevance, Reproducibility, Timeliness, Traceability
        "impactOfPoorDQ": "Poor strategic decisions based on flawed financial insights. Misleading performance assessments. Regulatory compliance issues with external reporting. Reduced investor confidence."
      },
      {
        "stageId": "R2R_S04",
        "stageName": "Budgeting & Forecasting",
        "commonPainPoints": [
          "Budgets and forecasts based on inaccurate historical data or flawed assumptions.",
          "Difficulty in consolidating budget inputs from different departments.",
          "Lack of agility in re-forecasting based on changing market conditions.",
          "Poor alignment between strategic plans and financial forecasts."
        ],
        "criticalDimensionDamaIds": [3, 8, 10, 12, 14, 20, 26, 44, 48, 50], // Accuracy, Coherence, Comparability(Time), Completeness(Rec,Val), Consistency, Currency, Reasonability, Relevance, Reproducibility
        "impactOfPoorDQ": "Unrealistic budgets leading to poor resource allocation. Inaccurate forecasts resulting in missed targets or financial surprises. Inability to effectively plan for the future."
      },
      {
        "stageId": "R2R_S05",
        "stageName": "Audit & Compliance",
        "commonPainPoints": [
          "Difficult and time-consuming audit processes due to poor data trails.",
          "Inability to provide auditors with requested supporting documentation quickly.",
          "Audit findings related to data inaccuracies or control weaknesses.",
          "Risk of non-compliance with accounting standards (IFRS, GAAP) or tax regulations."
        ],
        "criticalDimensionDamaIds": [1, 3, 12, 14, 16, 17, 19, 20, 34, 45, 50, 52, 54, 57], // Access Security, Accuracy, Completeness(Rec,Val,Meta), Compliance(Data), Confidentiality, Consistency, MetaCompliance, Recoverability, Reproducibility, Retention, Traceability, Validity
        "impactOfPoorDQ": "Increased audit fees and longer audit cycles. Qualified audit opinions or material weakness findings. Reputational damage. Potential legal and financial penalties for non-compliance."
      }
    ]
  },
  {
    "lifecycleId": "LC_I2M", // Idea to Market
    "stages": [
      {
        "stageId": "I2M_S01",
        "stageName": "Ideation & Concept Generation",
        "commonPainPoints": [
          "Lack of reliable market research data or customer insights to fuel ideas.",
          "Difficulty in accessing and analyzing past product performance data.",
          "Poor collaboration and knowledge sharing for new ideas across teams.",
          "Subjective idea screening not based on data-driven criteria."
        ],
        "criticalDimensionDamaIds": [2, 3, 5, 12, 14, 26, 36, 48, 51, 59], // Accessibility, Accuracy, Availability, Completeness(Rec,Val), Currency, Objectivity, Relevance, Reputation, Variety
        "impactOfPoorDQ": "Missed market opportunities. Development of products that don't meet customer needs. Wasted R&D resources on unviable ideas. Slow innovation pipeline."
      },
      // ... (Other I2M stages to be fleshed out similarly) ...
      {
        "stageId": "I2M_S03",
        "stageName": "Design & Development",
        "commonPainPoints": [
          "Using incorrect or outdated component specifications.",
          "Poor version control for design documents leading to errors.",
          "Lack of accurate cost estimation data for materials and labor.",
          "Inefficient collaboration between design and engineering teams due to inconsistent data."
        ],
        "criticalDimensionDamaIds": [3, 4, 12, 14, 20, 26, 30, 48, 57], // Accuracy, Appropriateness, Completeness(Rec,Val), Consistency, Currency, Integrity, Relevance, Validity
        "impactOfPoorDQ": "Product defects and quality issues. Increased development costs and time overruns. Manufacturing problems due to design flaws. Delayed time-to-market."
      },
      {
        "stageId": "I2M_S05",
        "stageName": "Launch & Commercialization",
        "commonPainPoints": [
          "Inaccurate product information in marketing materials or sales channels.",
          "Poor coordination between marketing, sales, and production for launch.",
          "Inability to accurately track initial sales and customer feedback.",
          "Stockouts or overstocking due to flawed demand forecasting for the new product."
        ],
        "criticalDimensionDamaIds": [3, 5, 12, 14, 20, 26, 43, 48, 53], // Accuracy, Availability, Completeness(Rec,Val), Consistency, Currency, Punctuality, Relevance, Timeliness
        "impactOfPoorDQ": "Failed product launch. Wasted marketing spend. Customer dissatisfaction. Missed revenue targets."
      }
    ]
  },
  {
    "lifecycleId": "LC_CRM", // Customer Relationship Management
    "stages": [
      {
        "stageId": "CRM_S01",
        "stageName": "Lead Generation & Acquisition",
        "commonPainPoints": [
          "Targeting wrong audience due to inaccurate segmentation data.",
          "High cost per lead due to inefficient campaigns.",
          "Duplicate leads wasting sales effort.",
          "Incomplete lead information hindering qualification."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 48, 55, 56, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Relevance, Uniqueness(Obj,Rec), Validity
        "impactOfPoorDQ": "Wasted marketing budget. Low lead quality. Sales team frustration. Missed growth opportunities."
      },
      // ... (Other CRM stages to be fleshed out similarly) ...
      {
        "stageId": "CRM_S05",
        "stageName": "Customer Support & Issue Resolution",
        "commonPainPoints": [
          "Slow response times due to difficulty accessing customer history or product information.",
          "Inconsistent answers provided by different support agents.",
          "Inability to track issue status effectively.",
          "High volume of repeat issues due to lack of root cause analysis from support data."
        ],
        "criticalDimensionDamaIds": [2, 3, 5, 12, 14, 20, 26, 48, 53, 54], // Accessibility, Accuracy, Availability, Completeness(Rec,Val), Consistency, Currency, Relevance, Timeliness, Traceability
        "impactOfPoorDQ": "Low customer satisfaction. Increased customer churn. High support costs. Inefficient use of support resources."
      }
    ]
  },
  {
    "lifecycleId": "LC_OPS", // Operations & Execution Management
    "stages": [
      {
        "stageId": "OPS_S01",
        "stageName": "Demand & Capacity Planning",
        "commonPainPoints": [
          "Inaccurate demand forecasts leading to stockouts or excess inventory/capacity.",
          "Difficulty in aligning production/service capacity with actual demand.",
          "Poor resource scheduling (labor, materials, equipment) due to unreliable data.",
          "Lack of visibility into future constraints or bottlenecks."
        ],
        "criticalDimensionDamaIds": [3, 10, 12, 14, 20, 26, 44, 48, 50, 53, 59], // Accuracy, Comparability(Time), Completeness(Rec,Val), Consistency, Currency, Reasonability, Relevance, Reproducibility, Timeliness, Variety
        "impactOfPoorDQ": "Lost sales due to stockouts. Increased inventory holding costs. Underutilized or overstrained resources. Inefficient production schedules. Higher operational costs."
      },
      {
        "stageId": "OPS_S02",
        "stageName": "Production / Service Execution",
        "commonPainPoints": [
          "Errors in executing production orders or service tasks due to incorrect specifications or instructions.",
          "High defect rates or service failures.",
          "Inefficient workflows and bottlenecks.",
          "Lack of real-time visibility into production/service status."
        ],
        "criticalDimensionDamaIds": [3, 5, 12, 14, 20, 24, 26, 30, 32, 53, 57], // Accuracy, Availability, Completeness(Rec,Val), Consistency(Gen,RecLvl), Currency, Integrity, Latency, Timeliness, Validity
        "impactOfPoorDQ": "Increased scrap and rework costs. Lower product/service quality. Reduced throughput and productivity. Customer dissatisfaction. Safety incidents."
      },
      {
        "stageId": "OPS_S03",
        "stageName": "Inventory & Materials Management",
        "commonPainPoints": [
          "Inaccurate inventory records (quantities, locations).",
          "Frequent stockouts or excessive carrying costs for slow-moving items.",
          "Difficulty in tracking material movements or work-in-progress (WIP).",
          "Manual and error-prone stock-taking processes."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 30, 53, 55, 56, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Integrity, Timeliness, Uniqueness(Obj,Rec), Validity
        "impactOfPoorDQ": "Production stoppages due to material unavailability. High inventory holding costs. Wasted warehouse space. Inefficient order fulfillment."
      },
      {
        "stageId": "OPS_S04",
        "stageName": "Quality Control & Assurance",
        "commonPainPoints": [
          "Inconsistent application of quality standards or inspection procedures.",
          "Difficulty in tracking defect rates or identifying root causes of quality issues.",
          "Delayed identification of non-conforming products/services.",
          "Lack of reliable data for continuous quality improvement initiatives."
        ],
        "criticalDimensionDamaIds": [3, 10, 12, 14, 20, 26, 36, 41, 42, 48, 50, 53, 54, 57], // Accuracy, Comparability(Time), Completeness(Rec,Val), Consistency, Currency, Objectivity, Precision(1,2), Relevance, Reproducibility, Timeliness, Traceability, Validity
        "impactOfPoorDQ": "Increased cost of poor quality (scrap, rework, warranty claims). Customer complaints and returns. Damage to brand reputation. Regulatory compliance issues for quality standards."
      },
      {
        "stageId": "OPS_S05",
        "stageName": "Maintenance & Asset Management",
        "commonPainPoints": [
          "Unexpected equipment breakdowns leading to downtime.",
          "Inefficient scheduling of preventive maintenance.",
          "Lack of accurate data on asset performance, condition, or maintenance history.",
          "High maintenance costs or suboptimal asset utilization."
        ],
        "criticalDimensionDamaIds": [3, 10, 12, 14, 20, 26, 30, 48, 50, 53, 54, 57], // Accuracy, Comparability(Time), Completeness(Rec,Val), Consistency, Currency, Integrity, Relevance, Reproducibility, Timeliness, Traceability, Validity
        "impactOfPoorDQ": "Increased operational downtime and lost production. Higher repair costs. Reduced asset lifespan. Safety risks from poorly maintained equipment."
      },
      {
        "stageId": "OPS_S06",
        "stageName": "Logistics & Distribution (Outbound)",
        "commonPainPoints": [
          "Inefficient route planning leading to high transportation costs.",
          "Delayed deliveries or shipments to wrong locations.",
          "Lack of real-time visibility into shipment status.",
          "Damage to goods during transit due to poor handling or packaging information."
        ],
        "criticalDimensionDamaIds": [3, 12, 14, 20, 26, 30, 32, 48, 53, 57], // Accuracy, Completeness(Rec,Val), Consistency, Currency, Integrity, Latency, Relevance, Timeliness, Validity
        "impactOfPoorDQ": "Increased logistics costs. Customer dissatisfaction from delivery issues. Lost or damaged goods. Inefficient fleet utilization."
      },
      {
        "stageId": "OPS_S07",
        "stageName": "Operational Performance Monitoring & Reporting",
        "commonPainPoints": [
          "Reports based on inaccurate or outdated operational data.",
          "Difficulty in identifying true operational bottlenecks or areas for improvement.",
          "Lack of timely insights to make corrective actions.",
          "Inconsistent operational KPIs across different plants or shifts."
        ],
        "criticalDimensionDamaIds": [3, 5, 7, 10, 12, 14, 16, 20, 26, 31, 32, 44, 48, 50, 53], // Accuracy, Availability, Clarity(Meta), Comparability(Time), Completeness(Rec,Val,Meta), Consistency, Currency, Interpretability, Latency, Reasonability, Relevance, Reproducibility, Timeliness
        "impactOfPoorDQ": "Poor operational decision-making. Inability to effectively track performance against targets. Missed opportunities for efficiency gains. Subjective assessments of operational health."
      }
    ]
  }
]